# DATABASE MANAGEMENT SYSTEM(DBMS)

A DBMS contains "rows and columns" or you can also call it"tuples and attributes"

Working with database using SQL

1.Create a connection object.
2.From the connection object,create a cursor object.
3.Using the cursor object,call the execute method with create table query as the parameter.

A cursor in SQL is a temporary work area created in system memory when a SQL statement is executed.
A SQL cursor is a set of rows together with a pointer that identifies the current row.
It is a database object to retrieve data from a result set one row at a time.

In [ ]:
import sqlite3

Create database

In [ ]:
db=sqlite3.connect('student_detail_database21aug.db')

Create cursor

In [ ]:
cur=db.cursor()

In [ ]:
cur.execute('create table school_student(id int primary key, name text, marks int)')

Dont run more than once the above line because once you run it,it will create the table and if you go to run it another time then it will throw error as the table is already created.

In [ ]:
cur.execute('insert into school_student(id, name, marks) values(101, "John", 78)')

In [ ]:
db.commit()

In [ ]:
cur.execute('insert into school_student(id, name, marks) values(102,"Jacob", 44)')

In [ ]:
db.commit()

In [ ]:
cur.execute('insert into school_student(id, name, marks) values(103,"Archer", 69)')

In [ ]:
db.commit()

In [ ]:
cur.execute('insert into school_student(id, name, marks) values(104,"Stuart",84)')

In [ ]:
db.commit()

In [ ]:
results= cur.execute('select * from school_student')

for i in results:
    print(i)

In [ ]:
cur.execute('insert into school_student(id, name, marks) values(105,"Macullum", 81)')
db.commit()

In [ ]:
cur.execute('insert into school_student values(106,"Lee",90),(107,"Tait", 29),(108,"Mitchell",99)')
db.commit()

In [ ]:
results=cur.execute('select * from school_students')

for i in results:
    print(i)

In [ ]:
results=cur.execute('select * from school_students')
results.fetchall()

In [ ]:
results=cur.execute('select id from school_students')

for i results:
    print(i)

In [ ]:
results=cur.execute('select name from school_students')
for i in results:
    print(i)

In [ ]:
results=cur.execute('select id, name from school_students')

results.fetchall()

In [ ]:
results=cur.execute('select id, name, marks from school_students')

results.fetchall()

Both for loop and fetchall is the samee. But if you have more than one rows in your query try to use fetchall()

In [ ]:
results=cur.execute("select * from school_students where id=101")

for i in results:
    print(i)

In [ ]:
results=cur.execute("select * from school_students where id=102")

results.fetchone()

If you know that your result will be in one line then you can use fetchone() but if you result are multiple liner then you have to use for loop or fetchall.

In [ ]:
results=cur.execute("select* from school_students where name='Mitchell'")

results.fetchone()

With the help of "in" operator, we can find out the data of multiple values.

In [ ]:
results=cur.execute("select * from school_students where name in('John','Lee','Mitchell')")

for i in results:
    print(i)

"Order by" clause sort the data in ascending or descending order

In [ ]:
results=cur.execute("select * from school_student order by name asc")

for i in results:
    print(i)

# Creating a new database

In [6]:
import sqlite3

In [7]:
db=sqlite3.connect("school_student_databse21aug.db")

In [8]:
cur=db.cursor()

In [12]:
cur.execute('create table student_record(id int primary key, name text, marks int)')

In [ ]:
cur.execute('insert into student_record(id, name, marks) values(201,"Andrew", 49)')
db.commit()

In [ ]:
cur.execute('insert into student_record(id, name, marks) values(202,"Boston",77)')
db.commit()

In [10]:
cur.execute('insert into student_record values(203,"Flintoff",37),(204,"Chandwick",83),(205,"zayn",79)')

In [16]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

In [17]:
results=cur.execute('select name from student_record')

for i in results:
    print(i)

('Andrew',)
('Boston',)
('Flintoff',)
('Chandwick',)
('zayn',)

In [19]:
results=cur.execute('select * from student_record where name="Andrew"')

for i in results:
    print(i)

(201, 'Andrew', 49)

In [25]:
results=cur.execute('select * from student_record where name="Chandwick"')

results.fetchone()

(204, 'Chandwick', 83)

In [29]:
results=cur.execute('select * from student_record where marks=37')

results.fetchone()

(203, 'Flintoff', 37)

In [30]:
results=cur.execute('select * from student_record where name in("Andrew","Flintoff","Boston")')

results.fetchall()

[(201, 'Andrew', 49), (202, 'Boston', 77), (203, 'Flintoff', 37)]

In [34]:
results=cur.execute('select * from student_record where id in(201,202,203,204,205)')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

In [8]:
results=cur.execute('select * from student_record where id=204')

for i in results:
    print(i)

(204, 'Chandwick', 83)

In [11]:
results=cur.execute('select * from student_record where marks=37')

results.fetchone()

(203, 'Flintoff', 37)

Lets suppose you have two students whose name is Flintoff, then you will use fetchall(), it will fetch all the data of students having name Flintoff, but suppose you are searching for the student from id, then you can use fetchone() as the id of all the students will be unique.

In [12]:
results=cur.execute('select * from student_record where id=202')

results.fetchone()

(202, 'Boston', 77)

In [17]:
results=cur.execute('select * from student_record limit 4')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)

if you want to limit your data to a certain rows you can use "limit."

In [18]:
results=cur.execute('select * from student_record where id in(201,203,205)')

results.fetchall()

[(201, 'Andrew', 49), (203, 'Flintoff', 37), (205, 'zayn', 79)]

In [21]:
results=cur.execute('select * from student_record order by marks asc limit 3')

results.fetchall()

[(203, 'Flintoff', 37), (201, 'Andrew', 49), (202, 'Boston', 77)]

In [23]:
results=cur.execute('select name from student_record where marks =77')

results.fetchone()

('Boston',)

In [24]:
results=cur.execute('select * from student_record where marks>60 and marks<90')

for i in results:
    print(i)

(202, 'Boston', 77)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

In [26]:
results=cur.execute('select name from student_record where marks>40 and marks<80')

for i in results:
    print(i)

('Andrew',)
('Boston',)
('zayn',)

In [28]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

In [30]:
results=cur.execute('select * from student_record order by marks asc')

for i in results:
    print(i)

(203, 'Flintoff', 37)
(201, 'Andrew', 49)
(202, 'Boston', 77)
(205, 'zayn', 79)
(204, 'Chandwick', 83)

In [31]:
results=cur.execute('select * from student_record where name="Boston" and marks=77')

results.fetchall()

[(202, 'Boston', 77)]

In [32]:
results=cur.execute('select * from student_record where name="Boston" and marks=83')

results.fetchone()

In "and" operator if one condition is true and other condition is false then you will never get an answer just like in above case. But in "or" operator if any of the condition is true then it will throw the result just like in below mention case.

In [37]:
results=cur.execute('select * from student_record where marks<70 or marks<60')
for i in results:
    print(i)

(201, 'Andrew', 49)
(203, 'Flintoff', 37)

In [38]:
results=cur.execute('select * from student_record where id=201 and marks=49')

for i in results:
    print(i)

(201, 'Andrew', 49)

In [39]:
results=cur.execute('select * from student_record where id=201 and marks=55')

for i in results:
    print(i)

In [40]:
results=cur.execute('select * from student_record where id=203 or name="Andrew"')

for i in results:
    print(i)

(201, 'Andrew', 49)
(203, 'Flintoff', 37)

# Aggregate functions

In [41]:
results=cur.execute('select max(marks) from student_record')

for i in results:
    print(i)

(83,)

In [42]:
results=cur.execute('select min(marks) from student_record')

for i in results:
    print(i)

(37,)

In [43]:
results=cur.execute('select count(id) from student_record')

for i in results:
    print(i)

(5,)

In [44]:
results=cur.execute('select avg(marks) from student_record')

for i in results:
    print(i)

(65.0,)

In [45]:
results=cur.execute('select sum(marks) from student_record')

for i in results:
    print(i)

(325,)

In [49]:
#null
results=cur.execute('select * from student_record where marks is null')

for i in results:
    print(i)

In [50]:
#not null
results=cur.execute('select * from student_record where marks is not null')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

Pattern matching characters

If you want to fetch some names starting with a particular alphabet or you want to perform something in which you want to fetch similar data, then we use "like" function. It goes in this manner "like 'D%'" and "like'_a%'", for example if you have Dorsey and David names in you names column it will show you both the names as both starting from 'D'(means we need names which is staring from D and after that it could be anything). In this "%" defines "many" means show us all the names starting from D and "_" defines one character.First character could be anything then in between there is "a" and after that there can be any character or after that there is no character.Similarly in this way "__s%" defines first two character can be anything after that there is somewhere "s" in between and after that there can be any character or there cant be.

In [53]:
#Here we have only one name starting from "F",if we have more than one it could have shown us all.
results=cur.execute('select * from student_record where name like "F%"')

for i in results:
    print(i)

(203, 'Flintoff', 37)

In [54]:
results=cur.execute('select * from student_record where name like "_a%"')

for i in results:
    print(i)

(205, 'zayn', 79)

In [55]:
results=cur.execute('select * from student_record where name like"____t%"')

for i in results:
    print(i)

(203, 'Flintoff', 37)

In [56]:
results=cur.execute('select * from student_record where name like "%t%"')

for i in results:
    print(i)

(202, 'Boston', 77)
(203, 'Flintoff', 37)

In [57]:
results=cur.execute('select * from student_record where name like "%w"')

for i in results:
    print(i)

(201, 'Andrew', 49)

In [59]:
#display name having only four character.
results=cur.execute('select * from student_record where name like "____"')

for i in results:
    print(i)

(205, 'zayn', 79)

In [60]:
#"NOT in" is the opposite of in.
results=cur.execute('select * from student_record where id not in(202,204)')

for i in results:
    print(i)

(201, 'Andrew', 49)
(203, 'Flintoff', 37)
(205, 'zayn', 79)

# Update record

You can change or update your table using update command in this way.
   xyz=update<tablename> where<columnname>=<value> where <columnname>=<value>
Make sure to write "where" command otherwise it will update the whole column.

In [11]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 83)
(205, 'zayn', 79)

In [12]:
#update the record
sql="update student_record set marks=81 where id=204"
cur.execute(sql)

In [13]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Andrew', 49)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 81)
(205, 'zayn', 79)

In [15]:
#multiple records update
sql="update student_record set marks=55 where id in(201,205)"
cur.execute(sql)

In [16]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Johnson', 55)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 81)
(205, 'zayn', 55)

# Deleting the data

if you want to delete a certain row you can use"delete" command.
make sure to use "where" command also otherwise it will delete the entire table.

In [17]:
sql="delete from student_record where id=205"
cur.execute(sql)

In [19]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Johnson', 55)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 81)

In [21]:
sql="insert into student_record values(205,'Devilliers',66),(206,'Harris',71),(207,'Botham',98)"
cur.execute(sql)

In [22]:
results=cur.execute('select * from student_record')

for i in results:
    print(i)

(201, 'Johnson', 55)
(202, 'Boston', 77)
(203, 'Flintoff', 37)
(204, 'Chandwick', 81)
(205, 'Devilliers', 66)
(206, 'Harris', 71)
(207, 'Botham', 98)

# inserting records from csv file

In [7]:
cursor.execute('insert into scores values("Male", 501, 74),("Female",502,87),("Female",503,45),("Male",504,39),("Female",505,89), ("Male",506,77),("Male",507,100),("Female",508,12),("Male",509,71),("Male",510,45),("Female",511,70),("Male",512,55)')

In [8]:
results=cursor.execute("select * from scores")

for i in results:
    print(i)

('Male', 501, 74)
('Female', 502, 87)
('Female', 503, 45)
('Male', 504, 39)
('Female', 505, 89)
('Male', 506, 77)
('Male', 507, 100)
('Female', 508, 12)
('Male', 509, 71)
('Male', 510, 45)
('Female', 511, 70)
('Male', 512, 55)

Primary key means the value should be "Unique" and "not Blank". Difference between "Primary Key" and "Unique" is that in primary key both the condition needs to be fulfilled i.e. "Unique" and "not blank" but in "Unique" the values can be "Unique" or can also be "NULL", inside the "Unique" we can put the blank value but not in "Primary Key".

UNIQUE-- enter only unique values, no duplicate values
not null--no blank values can be inserted in table

In [10]:
import sqlite3

In [11]:
db=sqlite3.connect("C:\\Users\\ankush.parkhad\\Documents\\database folder(1)\\sports_database.db")

In [12]:
cur=db.cursor()

In [13]:
cur.execute("create table sport(id int primary key, sportname text unique, dateofevent date, country text not null)")

In [14]:
cur.execute("insert into sport values(1,'cricket', 2022-11-08, 'Australia')")

In [16]:
#This line will throw error as sportname is unique---- unique constraint failed
#cur.execute("insert into sport values(2,'cricket', 2022-11-10, 'England')")

In [ ]:
#This query will throw error: not null constraint  : can not leave any field blank
#cur.execute("insert into sport(3,'Tennis', 2022-11-12, NULL)")


# Employee database with DB and Python programmatically

right now we are just righting query directly, we but now lets learn to write it in a progamming language(Programmatically), we can make the user-defined function and then write the query and then call it. 
It is not necessary to write query in this way it is just for our conceptual understanding.

In [20]:
import sqlite3

In [23]:
con=sqlite3.connect("C:\\Users\\ankush.parkhad\\Documents\\database folder(1)\\emp_database.db")

In [31]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key, name text, salary real,department text, position text, dateofjoining date)")
    con.commit()

In [40]:
cur=con.cursor()
cur.execute("insert into employee values(2,'Johnson',8000, 'Marketing','Officer','2020-07-09')")

In [41]:
results=cur.execute('select * from employee')
for i in results:
    print(i)

(1, 'Jack', 9000.0, 'HR', 'Manager', '2019-07-09')
(2, 'Johnson', 8000.0, 'Marketing', 'Officer', '2020-07-09')

Question mark means dynamic values, we have to give run time data, run time data means any data and that data would be inserted in place of question mark.

Entities are raw data in which you can put any value,entity is not any keyword you can give it any name. Entities is nothing but rows

We can also pass values\arguments to an INSERT statement in the execute() method. You can use the question mark(?) as a placeholder for each value. The syntax of the INSERT will be like the following:

cur.execute('insert into employee(id, name, salary, department, position, dateofjoining) values (?,?,?,?,?,?)', entities)
entities=(2,"John", 4000, 'Engineer',2022-09-01)

In [45]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id, name, salary, department, position, dateofjoining) values(?,?,?,?,?,?)', entities)

In [62]:
entities=(3,'Andrew', 7000,'IT', 'Engineer', '2016-04-06')

In [64]:
entities=(5,'Marcus',14000,'IT', 'Engineer','2012-08-19')

In [49]:
entities=(4,'Misbah', 12000, 'Sales', 'jfhgrlkfh', '2015-08-09')
sql_insert(con,entities)

In [50]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=1')
    con.commit()

In [51]:
sql_update(con)

In [52]:
results=cur.execute('select * from employee')

for i in results:
    print(i)

(1, 'Martin', 9000.0, 'HR', 'Manager', '2019-07-09')
(2, 'Johnson', 8000.0, 'Marketing', 'Officer', '2020-07-09')
(3, 'Andrew', 7000.0, 'IT', 'Engineer', '2016-04-06')
(4, 'Misbah', 12000.0, 'Sales', 'jfhgrlkfh', '2015-08-09')

In [53]:
results=cur.execute('select min(salary) from employee')

results.fetchone()

(7000.0,)

In [54]:
results=cur.execute('select count(id) from employee')
results.fetchall()

[(4,)]

In [55]:
results=cur.execute('select distinct(department) from employee')
results.fetchall()

[('HR',), ('Marketing',), ('IT',), ('Sales',)]

In [56]:
results=cur.execute('select count(distinct(department)) from employee')
results.fetchall()

[(4,)]

Group by is used to make group on a particular grouping. Like we want to group salary of IT department then we use group by.

# Referential Integrity

If we have two tables in our database and both the tables have some columns common, we will not repeat the same coloumn and to avoid the duplicasy we will make a foreign key in second table so as it will not repeat any data which is present in our base table.

Foreign key is a kind of key which is also known as "Referential Integrity" which will allow to enter the data into the derived table if and only if the data is present in the base table primary key, if the data is not present in the base table primary key then that data cannot be entered into our new table. So this is basically a "Refrential Intergrity" which means one can make the foreign key data avaiable if and only if the data is present in the base table.

We can link the two table with the "Help of Referential Integrity" without making any data duplicasy, without making any columnn repititon. So if in any table we have made the primary key we can make the Foreign key in the second key and avoid duplicasy.

Both Primary key and foreign key is helping to make link between two tables without any repetiton of data.

Referential Integrity is used to maintain the data consistency between two tables, Rules are made in the database structure about how foreign keys should be used to ensure that changes, addition and deletion in the database maintain the data integrity. The referential integrity constraints state that if a foreign key in the first table refers to the primary key of the second table then every value of foreign key in the first table should either be null or present in the second table.

In [2]:
import sqlite3

In [3]:
db=sqlite3.connect('C:\\Users\\ankush.parkhad\\Documents\\database folder(1)\\student_course_databse.db')

In [4]:
cur=db.cursor()

constraints ----
unique -- enter only unique values, no duplicate values
not null -- no blank values can be inserted in table

In [ ]:
cur.execute("create table course(courseid int primary key, coursename text, duration int)")

In [6]:
cur.execute("create table student(roll_no int primary key, studentname text, age int, courseid int, foreign key(courseid) references course(courseid))")
#foreign key(courseid) references course(courseid) means foreign key(courseid) is referring to courseid of course table and linking both the table through it.

In [5]:
cur.execute("insert into course values(78,'Data Science', 12),(56,'Python Course',4),(101,'Database',7)")
print(cur.rowcount,"record(s) inserted")                            
db.commit()

3 record(s) inserted

In [7]:
cur.execute("insert into student values(1,'Jack',22, 78),(2,'John', 21, 56),(3,'Rudolf', 18 ,78),(4,'Jim', 21, 56)")
print(cur.rowcount,"record(s) inserted")
db.commit()

4 record(s) inserted

In [8]:
results=cur.execute('select * from course')
results.fetchall()

[(78, 'Data Science', 12), (56, 'Python Course', 4), (101, 'Database', 7)]

In [9]:
results=cur.execute('select * from student')
results.fetchall()

[(1, 'Jack', 22, 78),
 (2, 'John', 21, 56),
 (3, 'Rudolf', 18, 78),
 (4, 'Jim', 21, 56)]

In [12]:
results=cur.execute('select courseid from course where coursename="Data Science"')
for i in results:
    print(i)

(78,)

# Subquery

In [14]:
#this is how to use referential intergrity
#Subquery means query inside a query
#first wirte inner query(select courseid from course where coursename="Data Science")
#Then write outer query("select * from student where courseid=")

results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Data Science")')
results.fetchall()

[(1, 'Jack', 22, 78), (3, 'Rudolf', 18, 78)]

In [15]:
results=cur.execute('select * from student where courseid=(select courseid from course where coursename="Python Course")')
results.fetchall()

[(2, 'John', 21, 56), (4, 'Jim', 21, 56)]

# JOIN

DIFFERENT TYPES OF SQL JOINs
1.(INNER) JOIN: Returns records that have matching values in both tables.
2.LEFT(OUTER) JOIN: Returns all records from the left table, and the matched records from the right table.
3.RIGHT(OUTER) JOIN: Returns all records from the right table, and the matched records form the left table.
4.FULL(OUTER) JOIN: Returns all records when there is a matvh in either left or right table.

In [18]:
sql='select student.roll_no, student.studentname, course.courseid, course.coursename FROM student INNER JOIN course ON student.courseid = course.courseid'
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python Course')]

In [19]:
sql='select student.roll_no, student.studentname, course.courseid, course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid'
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (3, 'Rudolf', 78, 'Data Science'),
 (4, 'Jim', 56, 'Python Course')]

In [20]:
sql='select student.roll_no, student.studentname, course.courseid, course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid'
results=cur.execute(sql)
results.fetchall()

[(1, 'Jack', 78, 'Data Science'),
 (3, 'Rudolf', 78, 'Data Science'),
 (2, 'John', 56, 'Python Course'),
 (4, 'Jim', 56, 'Python Course'),
 (None, None, 101, 'Database')]